# -*- eval: (save-excursion (org-babel-goto-named-src-block "workshopPreamble") (org-babel-execute-src-block)) -*-
#+TITLE:     Einführung in Python
#+AUTHOR:    Jörg Reuter
#+EMAIL:     joerg@reuter.sc
#+DATE:      

#+PROPERTY: exports both
#+EXCLUDE_TAGS: noexport mitsetup

#+SETUPFILE: ../workshopPreamble.org

#+name: workshopPreamble
#+begin_src emacs-lisp :exports none :results silent :tangle no
  (load-file "../setupEnvironment.el")
#+end_src

#+name: setupR
#+begin_src R :exports none :tangle no :results silent
  rm(list=ls())
  .First <- function() {
    options(width=70)
    options(useFancyQuotes=FALSE)
    options(show.signif.stars=FALSE)
    options(scipen = 10)
    options(digits = 3)
  }
#+end_src

** UML-Diagrammme

UML-Diagramme werden eingesetzt um eine Software zu modellieren und sind nach ISO/IEC 19505 standardisiert. UML unterteilt sich hierbei in sieben Strukturdigramme und sieben Verhaltensdiagramme, sieh hierzu http://de.wikipedia.org/wiki/Unified_Modeling_Language.

Die große Anzahl von möglichen Diagrammen verwirrt bei dem ersten Kontakt mit UML. Welches Strukturdiagramm und welches Verhaltensdiagramm setze ich jetzt ein?

Um die Erstellung eines UML-Diagramms zu vereinfachen, gibt es eine große Anzahl von Programmen. Einen schönen Vergleich verschiedener Programme zur Erstellung von UML-Diagramme wurde im Februar 2012 auf der Internetseite http://www.pro-linux.de/artikel/2/1556/1,seite-1.html veröffentlicht. Hier kristallisieren sich zwei empfehlenswerte Programme heraus: Dia und Visual Paradigm. Dia ist Opensource und kann bei den meisten Distributionen über den Paket-Manager installiert werden. http://www.visual-paradigm.com/download/vpuml.jsp ist für den Einsatz in Bildungseinrichtungen kostenlos, aber nicht Opensource.

#+name: HelloWorld
#+begin_src python :exports both
print("Hallo Welt")     #Hello World ausgeben
#+end_src

#+RESULTS:
#+begin_example
Hallo Welt
#+end_example

Anmerkung:
Text nach dem '#'-Zeichen kommt ist ein Kommentar.
Wir verwenden zum programmieren eine kostenlose virtuelle Maschine von https://c9.io (siehe auch https://en.wikipedia.org/wiki/Cloud9_IDE)

* Cleanup							   :noexport:
#+name: cleanitallup
#+begin_src R 
  rm(list=ls())
#+end_src

#+RESULTS: cleanitallup
#+begin_example
> rm(list=ls())
> 
#+end_example

